%A = 0.62171;     %レベル1のLL
%A = 0.67234;     %レベル1のLH,HL
%A = 0.72709;     %レベル1のHH
%A = 0.34537;     %レベル2のLL
%A = 0.41317;     %レベル2のLH,HL
%A = 0.49428;     %レベル2のHH
%A = 0.28688;     %レベル3のHH
%A = 0.11792;     %レベル4のLH,HL
A = 0.045943;    %レベル5のLL
%A = 0.030018;    %レベル6のLH,HL
a = 0.495;       %用意された値
k = 0.466;       %用意された値
gs = 1.501;      %用意された値(LL)
%gs = 1;          %用意された値(LH,HL)
%gs = 0.534;      %用意された値(HH)
fs = 0.401;      %用意された値
%x1 = 80;        %任意の値（画素値）
x2 = 0;        %任意の値（画素値）
v = 1;           %距離
d = 5;           %レベル
%N = 285.35;         %画素値
N = 512;
xf1 = 0;
xf2 = 0;
r = (N*v*pi)/180;          %解像度
f = r*2^(-d);    %表示解像度rとウェーブレット分解レベルに関係する
%Y = a*10^(k*(log10(r)-log10((2^d)*gs*fs))^2);
Y = a*10^(k*(log10(r*2^(-d))-log10(gs*fs))^2);

%dx = sqrt((x1-(x1)^f)^2+(x2-(x2)^f)^2);

Sw = A/Y;
%Sw = 2*Y/A; %参考論文からの確認用

l = 1;
for x1 = -256:1:256
    dx = sqrt(((x1-xf1)^2)+((x2-xf2)^2));
    e = atand(dx/(N*v));
    fc = (2.3*log(64))/(0.106*(e+2.3));
    fd = (pi*N*v)/360;
    cut(l:1:512) = min(fc,fd);
    l = l+1;
end
plot(cut)
%stem(cut,'filled')

fm = min(2.3*log(64)/0.106*(2.3+atan(dx/N*v)), pi*N*v/360);
if f <= fm
Sf = exp(-0.0461*f*atan(dx/N*v));
else
Sf = 0;
end

S = (Sw^1) * (Sf^2.5);

